Visual Interface:
VI  -->  VIM
 vim:
    1.u 多级撤销
    2.vim运行在各种系统
    3.支持语法高亮
    4.支持图形界面
  
  
  命令模式：撤销，剪切，复制等等
  输入模式：输入
  底行模式：输入指令：保存，退出，搜索一些字符串
  
  vim abc
  cat abc 查看内容
  
  
  命令：
      i:切换到输入/编辑模式
      命令模式和底行模式：视觉上一样的
      d+d:删除一行
      d+G:删除全部
      vim+abc:打开文件定位到光标最后一行 vim +n abc : n代表打开文件后光标定位到第几号.
      vim +/imooc abc：光标定位到imooc第一次出现的行
      vim a b c:一次性创建和打开多个文件:进入文件可以通过底行模式指令：n向下个文件切换，N向前一个文件切换，prev前一个
      :w  保存
      :q 退出
      : ! 强制退出
      n:后一个字符，文件
      N:前一个文件，字符
      15:快速定位到第十五行
      /xxx:光标向后搜索xxx字符串，找到第一个之后定位
      ?xxxx:光标向前
      h:左
      j:下
      k:上
      l:右
      f:向下翻页
      b:向上翻页
      d:向下翻半页
      u:向上翻半页
      o:在光标所在位置下方插入一行，并切换到输入模式
      yy:复制光标所在行
      p:在光标所在行下方粘贴
      P:
